[
    {
        "title": "ICv2: The Not-So-Secret 2022 'Magic: The Gathering' Secret Lair and Trade Release Numbers",
        "link": "https://icv2.com/articles/news/view/52998/the-not-so-secret-2022-magic-the-gathering-secret-lair-trade-release-numbers",
        "published_date": "Thu, 05 Jan 2023 08:00:00 GMT",
        "content": "Over $5,000 MSRP in DTC Drops\n\n‘Magic: The Gathering’ 2022 Releases: Trade and Secret Lair (Data Collected by ICv2) Release, Drop Month Trade Release Date Secret Lair Drop Total Drop Sets Total Drop Set MSRPs Monthly Astrology Lands 24 $839.87 February Kamigawa: Neon Dynasty February Superdrop 15 $539.85 Secret Lair Pinfinity: Street Fighter 1 $39.00 April Streets of New Capenna April Superdrop 13 $463.87 May Pride Across the Multiverse 2 $88.99 June Commander Legends: Battle for Baldur's Gate Here Be Dragons 1 $125.00 June Superdrop 12 $413.88 Secret Lair: Pinfinity Superdrop Selects 2 $40.98 July Double Masters 2022 Secret Lair x Fortnite 4 $137.96 August August Superdrop 13 $463.87 September Dominaria United October Unfinity Lil' Walkers 2 $68.98 Warhammer 40K Festival-in-a-Box Las Vegas 1 $296.99 October Superdrop 25 $867.75 November The Brothers' War Secret Lair: Extra Life 2022 2 $88.99 Festival-in-a-Box Philadelphia 1 $269.99 December Magic Anniversary Countdown Set 1 $149.99 December Superdrop 24 $827.76 Secret Lair Total 143 $5,723.72\n\nThe Magic: The Gathering Secret Lair release schedule has wrapped up for 2022, and the numbers are in. Needless to say, there were a lot of Secret Lair drop sets offered as direct-to-consumer products to Magic: The Gathering fans in 2022. The total number of sets offered, between all foil and non-foil versions of the sets as well as merch sets, is 143 drop sets. Two of these Secret Lairs that could only be purchased as part of Festival-in-a-Box packages (see \" 'Festival in a Box' \").If a Magic fan were to buy one of each Secret Lair set (without utilizing bundling options during preorder), the total retail price would reach $5,723 plus shipping.The chart below shows the preorder dates of Secret Lair drops aligned with coinciding dates for the nearest trade releases of major sets. The preorder dates for the Secret Lair drops are all listed by the first day of availability for preorder, and the trade release sets are listed by official release date (some Magic product in 2022 was available at preleases prior to official launch). The Astrology Lands are the exception on the chart because they were offered each month of 2022. Also of note, the October Superdrop has an unusually high number of sets because some of the drops were offered in Japanese foil and non-foil versions as well as English (see \" 'October Superdrop' \"). Our set counts of Secret Lair sets differentiate between foil and non-foil sets.\n\nWe took a look how trade releases and Secret Lair drops lined up, comparing dates down to the week level (we displayed titles by month on this chart due to space considerations).\n\n\n\nThe three trade release set launches that had the highest MSRP in Secret Lair drops released in close proximity were the Unfinity, Warhammer 40,000 Commander, and The Brothers' War sets. Unfinity and Warhammer 40,000 both released on October 7, 2022, with $1,234 worth of drop sets at around the same time. The Brothers' War released on November 18, 2022, and $1,334 worth of drops were launched within a few weeks of that date. Some sets had significantly lower MSRP in drops launched during their release, including the hot-selling Double Masters 2022 ($137.96 worth of drops).\n\n\n\nThis massive release of direct-to-consumer products over the course of the year is part of an overall growth strategy for Hasbro and Wizards of the Coast. Hasbro CEO Chris Cocks and Wizards of the Coast and Digital Gaming President Cynthia Williams have both mentioned at different analyst events, including at the recent Hasbro Fireside chat (see \"Hasbro Fireside\"), that direct-to-consumer is a space that the company sees as having room to grow the brand. Universes Beyond is intertwined with Secret Lair as part of this growth strategy, a way to draw targeted fan bases outside to Magic: The Gathering as they highlight different IPs such as Transformers, Fortnite, and Street Fighter (see \"'Secret Lair x Street Fighter' Card Art Unveiled\")."
    },
    {
        "title": "Magic’s 2023 sets will wrap up the Phyrexian war, welcome Gandalf and Doctor Who",
        "link": "https://www.polygon.com/23552276/mtg-2023-preview-phyrexians-dominaria-innistrad-eldraine-doctor-who-lotr",
        "published_date": "Thu, 19 Jan 2023 08:00:00 GMT",
        "content": "Share All sharing options for: Magic’s 2023 sets will wrap up the Phyrexian war, welcome Gandalf and Doctor Who\n\nThe upcoming year marks the long-awaited conclusion to Magic: The Gathering’s ongoing Phyrexian invasion storyline, a yearslong saga that has embroiled the multiverse in a war that promises lasting consequences for some of the game’s most beloved heroes. But grand finales also mark new beginnings, with the eventual return to Magic’s divisive fairy-tale world, along with a couple highly anticipated crossovers with Lord of the Rings and Doctor Who for both paper and digital players.\n\nDominaria Remastered\n\nBut first, 2023’s busy slate of Magic releases kicks off with a final ode to the game’s historic 30-year run. Dominaria Remastered comes out in paper and Magic: The Gathering Online on Jan. 13, featuring cards from throughout the game’s past.\n\nPulled from 27 different sets that span the world of Dominaria, this draftable set features beloved cards dating as far back as Magic’s very first release. Although it’s not legal in the Standard format, Dominaria Remastered will feature a variety of highly sought-after classics including Vampiric Tutor, Birds of Paradise, Force of Will, and Sneak Attack.\n\nPhyrexia: All Will Be One and March of the Machine\n\nNext, players will witness an epic conflict years in the making, as the current Phyrexian storyline comes to its climax and conclusion across two sets and an epilogue, starting with Phyrexia: All Will Be One arriving on Feb. 10.\n\nEarly glimpses into the set reveal fan-favorite planeswalkers get corrupted by the sinister substance known as Phyrexian oil, so stakes are high, as this could mean the official death or even final cards for treasured characters. Unlike Dominaria United, this set will be legal in Standard, along with its follow-up, March of the Machine.\n\nThen just over two months later, the storyline comes to a close with March of the Machine on April 21. Although little is known about this release, Wizards of the Coast announced it is being paired with a follow-up mini set called March of the Machine: The Aftermath. An apparent epilogue to the story arc, The Aftermath will be out on both of Magic’s digital platforms, and in paper distributed in small packs of only five cards.\n\nThe Aftermath and its cute little packs come out on May 12, and will also be legal in Standard.\n\nLord of the Rings: Tales of Middle-earth\n\nThen, around Q3, the long-awaited Lord of the Rings: Tales of Middle-earth comes out in paper, Magic: The Gathering Arena, and Magic Online featuring renditions of legendary characters (from the novels, not the films), as well as creatures and settings in a draftable set that will be legal in Modern and eternal formats such as Commander, Legacy, and Vintage.\n\nFirst announced in 2021, Wizards of the Coast has remained mostly tight-lipped about set specifics. Among the limited information it has offered since the announcement is a stunning collage illustrated across 18 cards, depicting the Battle of the Pelennor Fields from The Return of the King. Although this preview features no text, the art suggests there could be cards for Middle-earth’s oliphaunts, riders of Rohan, ringwraiths, and even the city of Minas Tirith.\n\nSimilar to previous years’ Modern Horizons sets, Tales of Middle-earth will skip the Standard and Pioneer formats, and instead jump straight to Modern, Commander, Legacy, and Vintage. The set will also be draftable and will even come accompanied with special edition Secret Lair releases.\n\nAnd even though it’s skipping Standard and Pioneer, it is still slated to be playable on Arena, where it will also become part of the Historic and Alchemy digital formats.\n\nWhether Tales of Middle-earth bears the price tag of Modern Horizons is a particularly noteworthy question. Booster packs from those sets were usually a few dollars more than a typical Magic product, sometimes even double the price of a Standard release, but Hasbro got away with it since they’re designed for some of Magic’s most enfranchised players.\n\nWill Tales of Middle-earth opt for the usual pricing model to help invite fans of the books that might be new to Magic, or will it position itself as a premium product like some other non-Standard releases? More details could potentially arrive in the next few months.\n\nShadows Over Innistrad Remastered goes digital\n\nAround this time, Magic Arena players will also see a long-awaited re-release in Shadows Over Innistrad Remastered — two sets combined into one and added to Magic Arena in a single release.\n\nAlthough Shadows Over Innistrad and its follow-up, Eldritch Moon, first came out 2016, they were not included in the eventual release of Arena in 2018. Over time, Wizards of the Coast has slowly backfilled the Arena catalog with similar remastered sets that combine multiple releases into a single release.\n\nThe addition of Shadows and Eldritch Moon will introduce some important competitive cards to Arena’s Explorer format, making it one step closer to eventually becoming a true digital parallel to Pioneer.\n\nSome of the most anticipated cards expected to hit Arena with Shadows Over Innistrad Remastered include Thing in the Ice, Tireless Tracker, Westvale Abbey, and Traverse the Ulvenwald.\n\nDoctor Who\n\nThe year’s second Universes Beyond release that we know of features another ambitious crossover with a deeply beloved universe and cast: Doctor Who. Scheduled for fall 2023, the Doctor Who tie-in will bear some resemblance to last year’s Warhammer 40,000 crossover, with the release of four new preconstructed Commander decks, each featuring 100 ready-to-play cards with a mix of brand-new designs and reimagined reprints.\n\nAlong with the new Commander decks, there will be additional Doctor Who collectors’ boosters and a limited-edition print-on-demand Secret Lair release featuring 60 years of Doctors, companions, and villains from the series. Along with fan favorites such as Matt Smith and Tom Baker, the cards arrive just in time to feature the TV show’s newest Doctor, played by Ncuti Gatwa.\n\nWilds of Eldraine\n\nAs the year comes to a close, players will get one last Standard set on a familiar world we haven’t seen since 2020 with fall’s Wilds of Eldraine release. The exact release date has not been announced, but anticipation for this set is high following the competitive impact of 2020’s Throne of Eldraine, which led to seven different card bans across various competitive formats due to its significant power level and ambitious card designs.\n\nWill Wilds of Eldraine give us new bombs along the lines of Oko, Thief of Crowns or Once Upon a Time, or will Magic’s designers play it safer this time around? More details will likely emerge in the second half of the year.\n\nMagic endured quite a few ups and downs in 2022. While the return of formal competitive tournament play reinvigorated paper players with a brand-new chance to compete at the Pro Tour, the business of Magic came into stark focus when Bank of America accused Hasbro of mismanaging the Magic: The Gathering brand.\n\nFortunately for players, there’s no shortage of brand-new cards and reprinted classics on the horizon in 2023, but time will tell whether the Magic brand has the strength to endure another 30 years."
    },
    {
        "title": "\" Magic: The Gathering Enters SMITE for Year 10\"",
        "link": "https://www.gamespress.com/Magic-The-Gathering-Enters-SMITE-for-Year-10",
        "published_date": "Tue, 24 Jan 2023 08:00:00 GMT",
        "content": "ATLANTA – JANUARY 24 – Today, Hi-Rez released the massive Fire Giant Update for third-person action-MOBA SMITE , kicking off Year 10 and uniting with Magic: The Gathering. Along with the new God Surtr, the Conquest mode gets an entirely new map with fresh art and layout, new monsters, structures, objectives, and more for the Season of Monsters, the first of four coming in 2023.\n\nHere are the extensive Fire Giant Update notes: https://www.smitegame.com/news/fire-giant-update-10-1-update-notes/\n\nSMITE has just launched its three-month-long event featuring the ultimate card game Magic: The Gathering. The Crossover announcement earlier this month was met with fantastic enthusiasm as a great number of SMITE players have also been long time fans of the classic CCG.\n\nFive iconic Magic: The Gathering legends have become high-quality SMITE skins. In a dedicated in-game hub, each skin can be purchased either directly for 1200 gems or in a chest for 600 gems. The event also includes FREE rewards for all players and a multitude of cosmetics such as the Power Nine loading frame.\n\nFiery Chandra Nalaar is Pele, the Polynesian Goddess of volcanoes, while Atraxa is the winged angel of death Thanatos. Karn becomes Atlas and carries his massive Astrolabe as a weapon, an artifact only he can control. As Nu Wa, necromancer and Planeswalker Liliana Vess raises undead puppets bent to her will. Lastly, SMITE players can also become the most talented mind mage in the Multiverse, Jace Beleren, as a skin for Yu Huang.\n\nWhat’s more, five more MTG legends will travel to this plane with the next update, for a total of 10 playable skins from Magic: The Gathering in SMITE .\n\nRagnarok approaches. SMITE’s iconic jungle boss since open beta, the Fire Giant Surtr, is now a playable Warrior from the Nordic pantheon. After years of being slain by Gods in pursuit of his power, he finally walks free!\n\nSurtr’s apocalyptic awakening has been captured in this cinematic trailer: https://www.youtube.com/watch?v=pE4zAZwVWBc\n\nPlayers can also have a look behind the scenes at Surtr’s making with this blog post written by his designers: https://www.smitegame.com/news/surtr-a-closer-look/\n\nSurtr’s kit is exciting and powerful: throw lane minions, summon fiery imps, and become a flaming meteor falling from the heavens. Surtr’s Passive causes his flesh to crack into fragments he can pick up to gain back his health – unless his enemies step on it first and extinguish it. Surtr imbues his blade in the Flames of Muspell, his main destruction tool. With every soul he takes—including minions—the flames’ power increases near-endlessly, making Surtr a force to be reckoned with.\n\nAs an embodiment of Ragnarok itself, Surtr’s thirst for vengeance will consume all unless the Gods shut him down fast.\n\nSurtr’s ascent to divinity has brought Ragnarok-level destruction to Conquest, SMITE’s most strategic mode. The Fire Giant Update marks the beginning of the Season of Monsters, first of the four Seasons comprising Year 10. Each Season will introduce sweeping changes to the Conquest Map, plus game-changing mechanics.\n\nThe new Season of Monsters design affects the entire Conquest battleground: jungle, lane structure and fortified bases on both sides. The entirely new jungle is home to rogue Cyclops, new buffs, and treasure chests. At its center, Gods can confront the Fire Giant’s gargantuan successor! New ‘Tower Bastions’ structures now strengthen lane towers – but destroying them will give you the edge.\n\nGameplay-wise, God classes now have stronger identities through class-specific bonus stats – one for each. No fewer than forty-five items have been created, removed, or entirely revamped and the new Shard Relics now provide early game active abilities that encourage aggressive power plays.\n\nLaunching with the Season of Monsters, the Battle Pass: Boss Monsters is now live with four terrible foes calling for epic teamfights. These new skins for Kukulkan, Cernunnos, Guan Yu, and Arachne are inspired by the iconic final boss encounters in your favorite RPGs.\n\nFinally, the SMITE Year 10 Pass holds both exclusive instant unlocks and year-long content for all upcoming Gods in 2023. Plus, buy the Year 10 pass to get 1000 Gems and the Calamity Cat Sol Skin right away!\n\n-END-\n\nPress kit: https://drive.google.com/drive/folders/1N5BKCWTiA8_EBHc91RRleJffRdf76MEv\n\nFor media inquiries, assets, and interview requests, please contact:\n\nHenrique Fajardo, PR Specialist – hfajardo@hirezstudios.com\n\nFollow SMITE on Twitter | Facebook | Instagram | TikTok | Twitch | YouTube\n\nMagic: The Gathering, its logo, and all characters’ names and distinctive likenesses are property of Wizards of the Coast LLC. ©2023 Wizards.\n\nAbout SMITE\n\nSMITE is the online Battleground of the Gods, a mythology-themed action game for PC and consoles. Since launching in Europe and North America in March 2014, SMITE has quickly established itself as one of the genre-defining MOBAs and cemented its place in the top 3 with over 35 million players. Themed around gods of mythology and offering a third-person camera and more game modes than any other leading game in its genre, the game provides a unique, action-packed experience that puts the player in the thick of the action. SMITE is free-to-play on PC through Steam and EGS, Xbox Series X|S, Xbox One, PlayStation 5 and PlayStation 4.\n\nFor more information on SMITE, visit www.smitegame.com\n\nAbout Hi-Rez\n\nBased in Alpharetta, Georgia, Hi-Rez is an industry-leading video game publisher and developer at the forefront of the free-to-play, games-as-a-service industry. Hi-Rez’s games have been played by more than 100 million people worldwide across PC, Xbox Series X|S, Xbox One, PlayStation 5, PlayStation 4, iOS and Android. With three games regularly among the Top 10 free-to-play games on Steam, Hi-Rez is one of the few Western developers to have successfully launched multiple, multi-platform games as a service titles to a large audience. Having won multiple awards and accolades for innovation and technology, Hi-Rez has also been recognised for its company culture, leadership and diversity as an employer."
    },
    {
        "title": "5 most powerful Magic: The Gathering cards in Commander of 2022",
        "link": "https://www.sportskeeda.com/esports/5-powerful-magic-the-gathering-cards-commander-2022",
        "published_date": "Sun, 01 Jan 2023 08:00:00 GMT",
        "content": "One of the best parts about the Magic: The Gathering Commander format is that nearly any card is powerful. In the right deck, even weird cards like Dovescape could be a complete game-breaker. However, some of the cards available this year were significantly stronger than others. On top of that, some had the potential to warp multiple formats.\n\nI looked through some of my favorite cards in the Commander meta of Magic: The Gathering and what was going on around the internet. While every Magic player’s opinions and decks will be different, these cards usually dominated the game and will likely continue to do so into 2023.\n\nWhat were the most impactful Magic: The Gathering cards in Commander?\n\n5) Farewell\n\nFarewell in Magic: The Gathering (Image via Wizards of the Coast)\n\nWhile yes, Farewell is a little on the costly side, especially for a boardwipe card, it’s easily the best boardwipe in all of Commander. When it comes to Magic: The Gathering, having access to cards that clear the field of battle is crucial.\n\nBut Farewell is great, because it gives you choices. When you cast this spell, you can choose one or more of the following, and all the ones in play get exiled.\n\nArtifacts\n\nCreatures\n\nEnchantments\n\nGraveyards\n\nIs your opponent running an annoying, enchantment-heavy prison deck? Maybe they’re all about their obnoxious graveyard retrieval. Whatever the threat, you can exile it from the game. If you are running all artifacts, but nobody else is, you can remove all non-artifacts from play and have an unstoppable force to stomp out others.\n\nSure, you might have to exile some of your own cards too, but if other players slow down or stall completely, that’s just a small price to pay.\n\n4) Black Market Connections\n\nBlack Market Connections in Magic: The Gathering (Image via Wizards of the Coast)\n\nWhenever I run a Black deck, I’m going to make sure I have plenty of ways to get life back. This is due to cards like Black Market Connections. This gorgeous 3-drop Enchantment has a trio of useful abilities that you can activate at the cost of your life points. During the pre-combat phase, you pick an ability, trigger its effect, and lose that much life.\n\nSell Contraband: Create a treasure token. Lose 1 life.\n\nCreate a treasure token. Lose 1 life. Buy Information: Draw a card. Lose 2 life.\n\nDraw a card. Lose 2 life. Hire a Mercenary: Create a 3 power, 2 toughness colorless Shapeshifter creature with Changeling. Lose 3 life. (Changelings have all creature types)\n\nNo matter what you need to get an advantage on the board, it’s likely that this Magic: The Gathering card will provide it for you. You can even choose multiple of these abilities at each turn.\n\n3) Defiler of Vigor\n\nDefiler of Vigor in Magic: The Gathering (Image via Wizards of the Coast)\n\nThe Defiler of Vigor seldom leaves one's memory. There’s something special and satisfying about a Commander deck built around obnoxious, big, green creatures.\n\nThis creature, with its 6 power, 6 toughness, and trample, also lets you pay 2 life when casting a green permanent. Suddenly, those permanents cost less. However, this does not change the amount of colorless you play.\n\nYou don’t have to pay that 2 life, though. Since Green Magic: The Gathering decks can also easily ramp up their life totals, it’s not a big deal. It’s great to play a bunch of 1-drop elves for no mana and then get your life back.\n\nHowever, that’s not what makes this card scary. When you play this Magic: The Gathering creature, anytime you cast a green permanent spell, all of your creatures gain +1/+1.\n\nThis will make any creature-heavy deck a threat. I would love to see it in a Bolas’s Citadel deck, filled with low-cost green creatures. The board state will quickly spiral out of control as you grow in power.\n\n2) Ledger Shredder\n\nLedger Shredder in Magic: The Gathering (Image via Wizards of the Coast)\n\nWhen Ledger Shredder was first teased, I wasn’t sure that it would be such a beast. However, it’s an amazing card. It’s a 1 power and 3 toughness flyer at a bargain - 2 mana. However, whenever a player casts their second spell at each turn, Ledger Shredder connives.\n\nConnive is an ability that has you draw a card and then discard one. If you discarded a nonland, this creature gains a +1/+1 counter. Since it says players instead of you, it can quickly spiral out of control.\n\nMany decks gain advantages from utilizing this. Reanimator decks love having a constant way to pitch powerful creatures to the graveyard, for example.\n\nNot to mention how often people counterspell in Commander games. All of these players must consider if it’s worth making you stronger at the cost of countering others. The more players in the game, the stronger Ledger Shredder is.\n\nThe Value Bird is nothing to sneeze at. Ledger Shredder is a card that brings amazing value to all of your games, and there’s rarely a bad time to play it.\n\n1) Boseiju, Who Endures\n\nBoseju, Who Endures in Magic: The Gathering (Image via Wizards of the Coast)\n\nMany talk about how great the Kamigawa Channel lands are, and I tend to agree. Boseiju, Who Endures, is an absolute beast. These cards, regardless of format, tend to be must-own assets. However, the green Legendary Land is arguably the best.\n\nYou can choose to pay 1 green mana and discard it from your hand, to destroy an artifact, enchantment, or nonbasic land an opponent controls. Sure, they get land with a basic land typing, but you’re deleting one of their most powerful cards in exchange. It can also cost 1 green mana if you have at least one legendary creature.\n\nWhat makes Boseiju, Who Endures amazing in Commander - or any format - is its reactive ability. Only a handful of cards can stop the ability once you’ve triggered it, so your opponent doesn’t get to react on most occasions.\n\nFor this reason, it’s a threat, no matter what you do. Furthermore, there are ways to pull it back to your hand or to put it in play from the grave. Therefore, it’s never gone forever.\n\nPlenty of Magic: The Gathering cards almost made this list, but I wanted to highlight a few of my absolute favorites. These cards were incredibly strong for one reason or another and were a valuable asset to any Commander deck they share a color with."
    },
    {
        "title": "Magic: The Gathering – The 8 Best Green Cards In Dominaria Remastered - TheGamer",
        "link": "https://news.google.com/rss/articles/CBMiV2h0dHBzOi8vd3d3LnRoZWdhbWVyLmNvbS9tYWdpYy10aGUtZ2F0aGVyaW5nLW10Zy1kb21pbmFyaWEtcmVtYXN0ZXJlZC1iZXN0LWdyZWVuLWNhcmRzL9IBAA?oc=5&hl=en-US&gl=US&ceid=US:en",
        "published_date": "Sun, 01 Jan 2023 08:00:00 GMT",
        "content": "Magic: The Gathering – The 8 Best Green Cards In Dominaria Remastered  TheGamer"
    },
    {
        "title": "Magic The Gathering Phyrexia: All Will Be One Exclusive Card Preview",
        "link": "https://www.gameshub.com/news/news/magic-the-gathering-mtg-phyrexia-all-will-be-one-card-preview-38983/",
        "published_date": "Mon, 23 Jan 2023 08:00:00 GMT",
        "content": "Phyrexia: All Will Be One, the next Magic: The Gathering set, is almost here, and ahead of the release we have a global exclusive preview of one of the cards set to launch on 10 February 2022.\n\nThe newest set sees the iconic heroes of the game facing off against the ever-growing threat of the Phyrexians, off the back of the previous expansion, The Brother’s War. The plane of New Phyrexia is the stage for the events of Phyrexia: All Will Be One, and the third installment of the multi-set Phyrexian story arc is coming to a head as the Praetor Elesh Norn gets closer to her goal of conquering the Multiverse.\n\nThe fate of much-loved planeswalkers hang in the balance as the story ramps up on a massive scale. The Phyrexians are an even bigger threat now, in all of their bio-mechanical, H.R. Giger-esque glory, and players can expect plenty of twists and turns (and new mechanics) in the upcoming ninety-fifth Magic expansion.\n\nRead: Everything announced at Wizards Presents\n\nHere’s the first look at one of the new cards coming to Phyrexia: All Will Be One: Atraxa’s Skitterfang.\n\nImage: Wizards of the Coast\n\nThis colourless, three-mana cost artifact creature card makes use of the set’s new oil counters (that is, the glistening oil used to create Phyrexians through a process called compleation).\n\nOn entering the battlefield, Atraxa’s Skitterfang has three oil counters on it. These can be removed at the beginning of combat (one per turn) to give a target creature you control your choice of flying, vigilance, deathtouch, or lifelink until the end of turn.\n\nThe ability to quickly grant one of your creatures with any one of these abilities during the beginning of your combat phase makes this low mana-cost creature an effective addition to your deck.\n\nIn addition, Atraxa’s Skitterfang would pair well with cards that have the proliferate ability (choose any number of permanents and/or players, then give each another counter of each kind already there) to increase the number of times you can grant one of the temporary abilities to one of your creatures.\n\nGiven that Atraxa herself, the Phyrexian angel horror and one of the most popular commanders, is also arguably one of the most popular cards that uses the proliferate ability, it’s no surprise that Atraxa’s Skitterfang is primed for combos using the ability.\n\nHere’s a look at the full art for Atraxa’s Skitterfang:\n\nImage: Wizards of the Coast\n\nPhyrexia: All Will be One marks the second last entry in the Phyrexian story arc before the dramatic conclusion in March of the Machine. Magic: The Gathering senior game designer Adam Prosak says this expansion is a rare chance to visit the home plane of the story villains. ‘Most of our expansions have some sort of conflict with villains, but rarely do we see a set that is dedicated to exploring what it is like to be on the other side’.\n\nWith horror manga legend Junji Ito lending his skills to the set as a guest artist too, players are in for a dark, grotesque and visually stunning expansion, compleated planeswalkers and all.\n\n\n\nPhyrexia: All Will Be One releases on 10 February 2022. If you’re itching to check out the set before this, you can head to one of the Magic: The Gathering prerelease events at your local Wizards Play Network store. Find your nearest WPN store."
    },
    {
        "title": "Magic: The Gathering made over $1 billion in 2022",
        "link": "https://www.wargamer.com/magic-the-gathering/one-billion-dollars-2022",
        "published_date": "Tue, 03 Jan 2023 08:00:00 GMT",
        "content": "Magic: The Gathering’s head designer Mark Rosewater has confirmed the card game earned more than $1 billion in 2022. Writing to his Tumblr blog on January 2, Rosewater said this is something MTG has never done before.\n\nSince Hasbro’s investor day last October, we’ve known that Magic was approaching this target, with higher ups at Hasbro referring to their ‘first $1 billion dollar brand’ and all but breaking out the champagne a couple months early. During the presentation, Cynthia Williams said the TCG had raked in over a billion in the past 12 months, so, barring catastrophe, it was fairly safe to assume it would reach the big billion dollars when looking just at the 12 months of 2022.\n\nStill, it’s a major milestone for Magic and good news for Wizards of the Coast (which makes Magic: The Gathering and Dungeons and Dragons) after the company’s disappointing third quarter. Of note, in 2021 Wizards topped $1 billion in revenue, in what was its best ever year, but now MTG is achieving that all on its own.\n\nRosewater shared the information in response to an MTG player concerned about “the volume of product being released”. Across 2022, this has been a constant worry among the games’ online fans, with many complaining about feeling burnout and confusion due to the number of new cards and sets released. In response, the head designer echoed a recent point that “internet chatter” is not a good basis for making decisions about Magic.\n\n“The metric of success though won’t be volume of internet chatter,” he pointed out. “It will be all the metrics we look at (play numbers, sales numbers, digital numbers, social media metrics, market research, etc.)”\n\nRosewater added that “for the last three years, the metrics have not just been good, but the best we’ve ever seen” – suggesting that Magic is doing well in every way that Wizards measures. He also said that the increase of supplemental MTG products is not “being done without careful thought. We want Magic to be healthy, not just for the present, but for the future.”\n\nFor more information on what the near future of Magic holds, check out our guide to the MTG 2023 release schedule. Or, if your heads in a spin with the speed of releases, here’s every MTG set in order."
    },
    {
        "title": "Here’s An Exclusive Magic: The Gathering Phyrexia: All Will Be One Card Preview - Press Start Australia",
        "link": "https://press-start.com.au/news/2023/01/18/heres-an-exclusive-magic-the-gathering-phyrexia-all-will-be-one-card-preview/",
        "published_date": "Wed, 18 Jan 2023 08:00:00 GMT",
        "content": "Here’s An Exclusive Magic: The Gathering Phyrexia: All Will Be One Card Preview  Press Start Australia"
    },
    {
        "title": "Magic The Gathering Phyrexia: All Will Be One Preview card - Charforger",
        "link": "https://sg.news.yahoo.com/magic-the-gathering-phyrexia-all-will-be-one-preview-card-charforger-071123006.html",
        "published_date": "Mon, 23 Jan 2023 08:00:00 GMT",
        "content": "The first Standard legal set of 2023 Phyrexia: All Will Be One will be released on 10 February, and as usual, it’s time for another card preview.\n\nThe new set will bring Magic: The Gathering players back to a familiar plane, New Phyrexia, or Mirrodin as it was previously known before it became slowly corrupted by Phyrexian oil.\n\nWith oil as an important feature of Phyrexian technology, it’s no surprise that the new card Charforger has the ability to generate oil counters.\n\nCharforger preview card provided by Wizards of the Coast for Yahoo Southeast Asia. (Image: Wizards of the Coast)\n\nFor one generic, one black and one red mana, Charforger is a 2/3 Phyrexian Beast packed with quite a few abilities.\n\nTo start things off, Charforger enters the battlefield with another 1/1 red Phyrexian Goblin token. Along with cards in the new set like Mondrak, Glory Dominus, Charforger might even enter the battlefield with more tokens!\n\n(Image: Wizards of the Coast)\n\nCharforger also generates an oil counter whenever a creature or artifact is put into a graveyard. This means that even the death of creature tokens and sacrificing of Treasure tokens will generate an oil counter on Charforger.\n\nA player can then remove three oil counters from Charforger to exile the top card of their library, and choose to play it within this turn.\n\nThis is arguably Charforger’s best ability, because players with top-deck knowledge can choose to exile away cards they don’t want, or just simply use this ability as card advantage during their own turn.\n\nWith Proliferate returning as a mechanic in Phyrexia: All Will Be One, it will also be much easier to generate more oil counters on Charforger.\n\nA compleated Vraska betrays her lover Jace Beleren (Image: Wizards of the Coast)\n\nCharforger's potential downsides are its mana cost (requiring two colours to cast) and colour identity (it can only be played in Rakdos or more coloured decks), but I still think it is a contender for the next Standard deckbuilders.\n\nPre-release for Phyrexia: All Will Be One will take place between 3-9 February, and the time to face Elesh Norn and her machines is coming soon!\n\nJay Chan plays a lot of Dota 2 and MTG. He's terrible in Dota 2 and a scrub in MTG, and maybe spends too much money on both games.\n\nFor more gaming news updates, visit https://yhoo.it/YahooGamingSEA. Also follow us on Twitter, as well as our Gaming channel on YouTube, and check out Yahoo Esports Southeast Asia’s Facebook page!"
    },
    {
        "title": "Magic: The Gathering Phyrexia: All Will Be One Set Adds New Toxic And Corrupted Mechanics - GameSpot",
        "link": "https://news.google.com/rss/articles/CBMihwFodHRwczovL3d3dy5nYW1lc3BvdC5jb20vYXJ0aWNsZXMvbWFnaWMtdGhlLWdhdGhlcmluZy1waHlyZXhpYS1hbGwtd2lsbC1iZS1vbmUtc2V0LWFkZHMtbmV3LXRveGljLWFuZC1jb3JydXB0ZWQtbWVjaGFuaWNzLzExMDAtNjUxMDU5MC_SAQA?oc=5&hl=en-US&gl=US&ceid=US:en",
        "published_date": "Tue, 17 Jan 2023 08:00:00 GMT",
        "content": "Magic: The Gathering Phyrexia: All Will Be One Set Adds New Toxic And Corrupted Mechanics  GameSpot"
    }
]